#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <time.h>
int zhuangbei();//装备、宝石选择
int panduan();//判断是否暴击闪避及波动值选定
int juese();//角色选择及技能确定
int jieshao();//游戏介绍
double B,b;//暴击
double S,s;//攻速
int M,m;//生命
int G,g;//攻击
double H,h;//回避
int F,f;//护甲（防御）
int V=1;//选择

int main()
{
	int E, e;
	int X;//选择界面
	printf("----------------------------------------------------------欢迎来到王者峡谷-------------------------------------------------\n");
	printf("请输入指定数字开始游戏体验：\n");
	printf("1:游戏介绍\n");
	printf("2:角色技能介绍及选择\n");
	printf("3:装备、宝石介绍及选择\n");
	printf("4:下一角色设定\n");
	printf("玩家一设定:\n");
	while (1) 
	{
		scanf_s("%1d", &X);
		switch (X)
		{
		case 1:jieshao(); break;
		case 2:juese(); break;
		case 3:zhuangbei(); break;
		case 4: {printf("玩家二设定\n"); V += 1; }; break;
		}
		if (X == 4)break;
    } 
	while (1)
	{
		scanf_s("%1d", &X);
		switch (X)
		{
		case 1:jieshao(); break;
		case 2:juese(); break;
		case 3:zhuangbei(); break;
		case 4:printf("---------------------------------------------------游戏开始-----------------------------------------------------\n"); break;
		}
		if (X == 4)break;
	}
	while (m > 0 && M > 0)
	{
		if (s == S)
		{
			E = S;
			e = s;
			V = 1;
			panduan();
			V = 2;
			panduan();
		}
		else
		{
			while (s > 0 || S > 0)
			{
				E = S;
				e = s;
				if (S > 0)
				{ V = 1;
				panduan();
				S = S - 1;
				}
				if (s > 0)
				{
					V = 2;
					panduan();
					s = s - 1;
				}

			}
		}
		S = E;
		s = e;

	}
	printf("%f   %f   %d  %d  %d  %d  %f  %f  %f  %f  %d  %d  ", H, h, G, g, F, f, B, b, S, s, M, m);
	if (M > m)printf("玩家一获胜");
	else printf("玩家二获胜");
	getchar();
	getchar();
	return 0;

}
int zhuangbei()
{
	int X;//武器选择
	int x;//宝石选择
	printf("武器：\n""无尽战刃\n""攻击力+120  暴击率+20%%\n");
	printf("防具:\n""不祥征兆\n""护甲+240  生命+1200\n");
	printf("请在武器和防具中选择一个：输入1选择武器，输入2选择防具。\n");
		scanf_s("%1d", &X);
		if (V == 1) {
			if (X == 1)
			{
				B = B + 0.2;
				G = G + 120;
				printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
			}
			else
			{
				M = M + 1200;
				F = F + 240;
				printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
			}
			printf("-----------------------------------------------宝石选择---------------------------------------------------------------\n");
			printf("请输入对应字符在一下6颗宝石中选择一个：\n");
			printf("1.攻击+60\n");
			printf("2.护甲+120\n");
			printf("3.暴击+10%%\n");
			printf("4.生命+600\n");
			printf("5.闪避+5%% \n");
			printf("6.攻速+10%% \n");
			scanf_s("%1d", &x);
			switch (x)
			{
			case 1:G = G + 60; break;
			case 2:F = F + 120; break;
			case 3:B = B + 0.1; break;
			case 4:M = M + 600; break;
			case 5:H = H + 0.05; break;
			case 6:S = S + 0.1; break;
			}
			printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
		}
		else
		{
			scanf_s("%1d", &X);
			if (X == 1)
			{
				b = b + 0.2;
				g = g + 120;
				printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
			}
			else
			{
				m = m + 1200;
				f = f + 240;
				printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
			}
			printf("-----------------------------------------------宝石选择---------------------------------------------------------------\n");
			printf("请输入对应字符在一下6颗宝石中选择一个：\n");
			printf("1.攻击+60\n");
			printf("2.护甲+120\n");
			printf("3.暴击+10%%\n");
			printf("4.生命+600\n");
			printf("5.闪避+5%% \n");
			printf("6.攻速+10%% \n");
			scanf_s("%1d", &x);
			switch (x)
			{
			case 1:g = g + 60; break;
			case 2:f = f + 120; break;
			case 3:b = b + 0.1; break;
			case 4:m = m + 600; break;
			case 5:h = h + 0.05; break;
			case 6:s = s + 0.1; break;
			}
			printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
		
		}
		return 0;
}
int juese()
{
	int X;
	printf("输入对应数字选择英雄：\n");
	printf("角色1：\n"   "    突进：孙悟空\n"  "生命：6585  攻击：349  防御：345  暴击：20%%  攻速：0.2  闪避：0.2\n");
	printf("角色2：\n"   "    战士：凯     \n" "生命：6700  攻击：328  防御：388  暴击： 5%%  攻速：0.3  闪避：0.12\n");
	printf("角色3： \n " "     坦克：刘禅\n"   "生命：8581  攻击：295  防御：459  暴击： 1%%  攻速：0.1  闪避：0.03\n");
	scanf_s("%1d", &X);
	if (V==1)
	{
		switch (X)
		{
		case 1:
		{
			M =  6585; G =  349; F =  145; B =  0.2; S =  0.2; H =  0.2;
		}; break;
		case 2:
		{
			M =  6700; G =  328; F =  188; B =  0.05; S =  0.3; H =  0.12;
		}; break;
		case 3:
		{
			M =  8581; G =  295; F = 200; B =  0.01; S =  0.1; H =  0.03;
		}; break;
		}
		printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
	}
	else
	{
		switch (X)
		{
		case 1:
		{
			m =  6585; g =  349; f =  145; b =  0.2; s =  0.2; h =  0.02;
		}; break;
		case 2:
		{
			m =  6700; g =  328; f =  188; b =  0.05; s =  0.3; h =  0.12;
		}; break;
		case 3:
		{
			m =  8581; g =  295; f = 200; b =  0.01; s =  0.1; h =  0.03;
		}; break;
		}
		printf("-----------------------------------------------选择结束---------------------------------------------------------\n");
	}
	return 0;

}
int jieshao()
{
	printf("该游戏为双人对战游戏。每名玩家可从3名英雄中任选一位并为其装备武器或铠甲。每名玩家还可选择一颗护身宝石。");
	return 0;
}
int panduan()
{
	int i;
	int U;//攻击波动
	int I;//防御波动
	int Y;//是否暴击
	int T;//是否闪避
	srand(time(0));
	if (V == 1)
	
	{
		printf("玩家一的回合\n");
		for (i = 0; I = i < 3; i++)
		{
			Y = rand() / (32767 / (100 - 1 + 1) + 1) + 1;
			T = rand() / (32767 / (100 - 1 + 1) + 1) + 1;

			U = rand() / (32767 / (G - (G - 50) + 1) + 1) + (G - 50);
			I = rand() / (32767 / (F - (F - 50) + 1) + 1) + (F - 50);
		}

		if (T <= 100 * H)
		{
			U = 0;
			printf("玩家二闪避\n");
		}

		if (Y <= 100 * B)
		{
			U = U * 2;
			printf("玩家一暴击\n");
		}
		if (I < U)U = U - I;
		m = m - U;
		printf("玩家二剩余血量：%d\n", m);
	  }
	else
	{
		printf("玩家二的回合\n");
		for (i = 0; i < 3; i++)
		{
			Y = rand() / (32767 / (100 - 1 + 1) + 1) + 1;
			T = rand() / (32767 / (100 - 1 + 1) + 1) + 1;

			U = rand() / (32767 / (g - (g - 50) + 1) + 1) + (g - 50);
			I = rand() / (32767 / (f - (f - 50) + 1) + 1) + (f - 50);
		}

		if (T <= 100 * H)
		{
			U = 0;
			printf("玩家一闪避\n");
		}
		if (Y <= 100 * B) {
			U = U * 2;
			printf("玩家二暴击\n");
		}
		if (I < U)U = U - I;
		M = M - U;
		printf("玩家一剩余血量：%d\n", M);
	}

	return 0;
	
}